tests/performance/slot-1000-players.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="T-090 Slot 1000 Players Load Test" enabled="true">
      <stringProp name="TestPlan.comments">1000 concurrent players place slot bets for 60 seconds against the real contract POST /api/v1/game/slot/spin (body {bet, clientSeed}; idempotency key is generated server-side, never sent by the client). Each iteration fires two distinct spins; each spin RESPONSE is asserted to carry a non-negative balance. The spin response already returns the updated wallet balance (WalletView.balance), so — matching the real client (SlotGame.jsx uses setBalance(spinResult.wallet), it never polls GET /wallet/balance per spin) — no separate balance query is issued. This keeps the load faithful to real usage and removes the redundant read that used to contend for the wallet Postgres write pool (T-090 optimization C).</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Test Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Gateway HTTP Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp>
        <stringProp name="HTTPSampler.port">${__P(port,8080)}</stringProp>
        <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">${__P(connect_timeout_ms,2000)}</stringProp>
        <stringProp name="HTTPSampler.response_timeout">${__P(response_timeout_ms,5000)}</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Authenticated JSON Headers" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer ${accessToken}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="1000 Funded Player Credentials" enabled="true">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">${__P(players_csv,tests/performance/players.csv)}</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">true</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">playerId,accessToken</stringProp>
      </CSVDataSet>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="1000 Concurrent Slot Players" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Continuous Bets" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(threads,1000)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp_up_seconds,1)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration_seconds,60)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01 Primary Slot Spin" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Spin Body" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value"><![CDATA[{"bet":${__P(bet,100)},"clientSeed":"${clientSeed}"}]]></stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">${__P(spin_path,/api/v1/game/slot/spin)}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Create Unique Spin Seed" enabled="true">
            <stringProp name="cacheKey">t090-create-spin-seed</stringProp>
            <stringProp name="script"><![CDATA[
def sequence = (vars.get('threadSequence') ?: '0').toLong() + 1
vars.put('threadSequence', sequence.toString())
def playerId = vars.get('playerId')
def suffix = "${ctx.getThreadNum()}-${sequence}-${System.currentTimeMillis()}"
// Idempotency key is generated server-side; the client only supplies a unique clientSeed (Provably Fair).
vars.put('clientSeed', "t090-${playerId}-${suffix}")
]]></stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Primary Spin Must Return 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="2xx">2\d\d</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Primary slot spin must return 2xx; 4xx/5xx are test failures.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Capture Round Identity And Reject Negative Balance" enabled="true">
            <stringProp name="cacheKey">t090-primary-assertion</stringProp>
            <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper

if (prev.getResponseCode()?.startsWith('5')) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage("5xx response from primary spin: ${prev.getResponseCode()}")
    return
}

try {
    def json = new JsonSlurper().parseText(prev.getResponseDataAsString())
    def root = json?.data != null ? json.data : json
    def identity = root?.roundId ?: root?.transactionId ?: root?.id
    if (identity == null) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage('Primary spin response must expose roundId for the SpinResponse contract.')
        return
    }
    vars.put('primaryIdentity', identity.toString())

    def balance = root?.wallet?.balance
    if (balance == null) balance = root?.balanceAfter
    if (balance == null) balance = root?.balance
    if (balance != null && new BigDecimal(balance.toString()) < 0) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage("Negative balance returned by primary spin: ${balance}")
    }
} catch (Exception exception) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage("Primary spin response is not valid JSON: ${exception.message}")
}
]]></stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02 Secondary Slot Spin" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Secondary Spin Body" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value"><![CDATA[{"bet":${__P(bet,100)},"clientSeed":"${clientSeed}"}]]></stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">${__P(spin_path,/api/v1/game/slot/spin)}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Create Secondary Spin Seed" enabled="true">
            <stringProp name="cacheKey">t090-create-secondary-seed</stringProp>
            <stringProp name="script"><![CDATA[
def sequence = (vars.get('threadSequence') ?: '0').toLong() + 1
vars.put('threadSequence', sequence.toString())
def playerId = vars.get('playerId')
def suffix = "${ctx.getThreadNum()}-${sequence}-${System.currentTimeMillis()}-b"
// A distinct spin with its own clientSeed; the server again assigns a fresh idempotency key.
vars.put('clientSeed', "t090-${playerId}-${suffix}")
]]></stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Secondary Spin Must Return 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="2xx">2\d\d</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Secondary slot spin must return 2xx and must not become a 5xx.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Reject Negative Balance On Secondary Spin" enabled="true">
            <stringProp name="cacheKey">t090-secondary-assertion</stringProp>
            <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper

if (prev.getResponseCode()?.startsWith('5')) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage("5xx response from secondary spin: ${prev.getResponseCode()}")
    return
}

try {
    def json = new JsonSlurper().parseText(prev.getResponseDataAsString())
    def root = json?.data != null ? json.data : json
    def identity = root?.roundId ?: root?.transactionId ?: root?.id
    if (identity == null) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage('Secondary spin response must expose roundId for the SpinResponse contract.')
        return
    }

    def balance = root?.wallet?.balance
    if (balance == null) balance = root?.balanceAfter
    if (balance == null) balance = root?.balance
    if (balance != null && new BigDecimal(balance.toString()) < 0) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage("Negative balance returned by secondary spin: ${balance}")
    }
} catch (Exception exception) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage("Secondary spin response is not valid JSON: ${exception.message}")
}
]]></stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <PreciseThroughputTimer guiclass="TestBeanGUI" testclass="PreciseThroughputTimer" testname="Open-Model Pacing (P1: target_rps spins/sec, schedule-based)" enabled="true">
            <intProp name="batchSize">1</intProp>
            <longProp name="batchThreadDelay">0</longProp>
            <stringProp name="duration">${__P(duration_seconds,60)}</stringProp>
            <boolProp name="perThread">false</boolProp>
            <longProp name="randomSeed">0</longProp>
            <stringProp name="throughput">${__P(target_rps,1000)}</stringProp>
            <intProp name="throughputPeriod">1</intProp>
          </PreciseThroughputTimer>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>